"app.title" = "Voice Search";
"header.recognitionMode" = "Recognition Mode";
"header.recognitionLanguage" = "Language";
"recognition.mode.onDevice" = "On-device";
"recognition.mode.server" = "Server";
"recognition.language.automatic" = "Auto-detect";
"recognition.language.japanese" = "Japanese (ja-JP)";
"recognition.language.englishUS" = "English (en-US)";
"status.dragFile" = "Drag and drop a file to start";
"status.modeChanged" = "Recognition mode changed to %@ (applies on re-run)";
"status.languageChanged" = "Recognition language changed to %@ (applies on re-run)";
"status.processingQueuedFile" = "Processing queued file (%ld total): %@";
"status.analyzingFile" = "Analyzing: %@";
"status.autoDetectingLanguage" = "Auto-detecting language: %@";
"status.emptyTranscript" = "No transcript words were extracted";
"status.extractedWordsWithMode" = "Extracted %ld words (%@)";
"status.extractedWords" = "Extracted %ld words";
"status.transcriptionFailed" = "Transcription failed (%@)";
"status.exportedText" = "Exported transcript: %@";
"error.prepareSettingsDirectory" = "Failed to prepare settings directory: %@";
"error.loadDroppedData" = "Failed to read dropped item: %@";
"error.lowWordCount" = "Very few words were extracted (%ld words / about %ld sec). Check language settings and audio quality.";
"error.noTranscriptToExport" = "There is no transcript to export";
"error.exportFailed" = "Failed to export transcript: %@";
"error.dictionaryLoadFailed" = "Failed to load dictionary: %@";
"error.dictionarySaveFailed" = "Failed to save dictionary: %@";
"error.failureMessageWithLogPath" = "%1$@\nLog: %2$@";
"error.speechAnalyzerUnavailable" = "The on-device recognizer (SpeechAnalyzer) is unavailable in this environment. Use server mode or run on a supported OS.";
"error.fileSelectionFailed" = "File selection failed: %@";
"source.dropPrompt" = "Click to choose a file\nor drag and drop";
"button.analyzing" = "Analyzing...";
"button.reanalyze" = "Re-run";
"button.clearFile" = "Clear file";
"button.exportText" = "Export text";
"help.clearFile" = "Clear the loaded file";
"search.placeholder" = "Search term";
"search.partialMatch" = "Partial match";
"search.results" = "Search Results";
"count.items" = "%ld items";
"transcript.title" = "Transcript";
"export.txtThreshold" = "TXT break threshold";
"export.panel.title" = "Save transcript text";
"export.format.title" = "Choose export format";
"export.format.message" = "You can save the transcript as TXT or SRT.";
"export.txt.header.transcript" = "Transcript";
"export.txt.header.timedWords" = "Timed Words";
"dictionary.title" = "Dictionary";
"dictionary.termPlaceholder" = "Canonical term";
"dictionary.aliasesPlaceholder" = "Aliases (comma-separated)";
"dictionary.empty" = "No dictionary terms yet";
"playback.playing" = "Playing";
"playback.stopped" = "Stopped";
"common.save" = "Save";
"common.cancel" = "Cancel";
"time.seconds" = "sec";
"speechAnalyzer.error.unavailable" = "SpeechAnalyzer is unavailable in this environment.";
"speechAnalyzer.error.unsupportedLocale" = "SpeechAnalyzer does not support locale %@.";
"speechAnalyzer.error.assetInstallFailed" = "Failed to prepare speech recognition assets: %@";
"speechAnalyzer.error.openAudioFailed" = "Failed to open audio file: %@";
"speechAnalyzer.error.startFailed" = "Failed to start SpeechAnalyzer: %@";
"speechURL.error.notAuthorized" = "Speech recognition permission is not granted. Enable it in System Settings > Privacy & Security > Speech Recognition.";
"speechURL.error.unsupportedLocale" = "Speech recognition is unavailable for this locale.";
"speechURL.error.missingPrivacyUsageDescription" = "Cannot start speech recognition because %@ is missing. Set a usage description in Info.plist.";
"failure.headline" = "Transcription failed (%@)";
"failure.cause" = "Cause: %@";
"failure.hint" = "Hint: %@";
"failure.hint.authorization" = "Check System Settings > Privacy & Security > Speech Recognition and confirm access is allowed.";
"failure.hint.noAudioTrack" = "Please provide a file with an audio track. For video, make sure audio is included.";
"failure.hint.unsupportedLocale" = "Change the recognition language and verify that the target language is available.";
"failure.hint.asset" = "Wait until speech recognition assets are ready, then run again.";
